Диплом/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>График</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресГрафикаДокумента = Параметры.АдресГрафикаДокумента;
	СформироватьНаСервере(ДиаграммаГанта, АдресГрафикаДокумента);
	
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьНаСервере(Диаграмма, АдресГрафикаДокумента)
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();      
	Диаграмма.ОбластьЗаголовка.Текст ="График отпусков";
	Диаграмма.АвтоОпределениеПолногоИнтервала =Ложь;
	ЭлементМеток = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементМеток.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ТабОбх = ПолучитьИзВременногоХранилища(АдресГрафикаДокумента);
	ДатаГода = ТабОбх[0].ДатаНачала;
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода(ДатаГода), КонецГода(ДатаГода));
	ТабОбх.Сортировать("Сотрудник");
	Сотрудник1 = Справочники.ВКМ_Сотрудники.ПустаяСсылка();
	СерияПлан = Диаграмма.Серии.Добавить();
	СерияПлан.Текст = "План";
	СерияПлан.Цвет = WebЦвета.СинеФиолетовый;
	Для Каждого стрТабл из ТабОбх Цикл
		Если Сотрудник1 <> СтрТабл.Сотрудник тогда
			Точка = Диаграмма.УстановитьТочку(стрТабл.Сотрудник);
			Значение = Диаграмма.ПолучитьЗначение(Точка, СерияПлан);        
		КонецЕсли;
		Интервал = Значение.Добавить();
		Интервал.Начало = стрТабл.ДатаНачала;
		Интервал.Конец = стрТабл.ДатаОкончания;
		Сотрудник1 = стрТабл.Сотрудник;	
	КонецЦикла;
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры
#КонецОбласти
